# Задача №1 За день машина проезжает n километров.Сколько дней нужно, чтобы проехать маршрут длинной m километров?
# input:
#n=700
#m=750
#output:
#2

n = 700
m = 750
print((m + n -1) // n )